docs/ex-nb01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-07 Fri 21:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>Excerpt From Lab Notebook</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="mrSCPI example org-mode notebook" />
<meta name="generator" content="Org Mode" />













</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/mrSCPI/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Excerpt From Lab Notebook</h1>
<p>
What follows is an excerpt from my lab notebook.  At the time I was working on an hybrid analog computer that used a microcontroller &amp; DAC to provide the
fixed analog voltages traditionally provided by "parameter" potentiometers in older systems.  The DAC was controlled by an SPI interface connected to the
microcontroller.  The microcontroller would <i>sometimes</i> come up faster than the DAC and start sending SPI signals to the DAC before the DAC was fully
initialized &#x2013; which burned up the DAC.  I lost two DACs before I realized what was happening.
</p>

<p>
Having the <a href="https://richmit.github.io/mrSCPI/"><code>mrSCPI</code></a> code in my notebook like this allows me to reproduce my bench hardware configuration by simply having <a href="https://orgmode.org/"><code>org-mode</code></a> evaluate the code.
And I can do that right in my editor while I'm reading my notes.
</p>

<p>
A lot of people talk about how important <b><a href="https://en.wikipedia.org/wiki/Reproducibility">Reproducibility</a></b> is to the scientific process, and that it is
worth the extra work.  The example below illustrates that reproducibility isn't necessarily a burden at all.  It can, in fact, be a productivity gain in the
long run.
</p>

<p>
<br />
</p>
<hr />
<hr />
<div class="org-center">
<p>
<code>.. BEGIN Excerpt .. BEGIN Excerpt .. BEGIN Excerpt .. BEGIN Excerpt .. BEGIN Excerpt ..</code>
</p>
</div>
<hr />
<hr />
<p>
<br />
</p>

<div id="outline-container-orga1a8f61" class="outline-2">
<h2 id="orga1a8f61"><span class="section-number-2">1.</span> Power Sequenceing</h2>
<div class="outline-text-2" id="text-1">
<p>
The DAC will be bricked if a voltage over 3V is applied to an SPI intput before the DAC is powered up and initializes.  The initialization takes about 30ms.
For this reason it is critical that I power up the DAC before I power up the microcontorler board:
</p>

<div class="org-src-container">
<pre class="src src-mrscpi"><span style="color: #00ffff;">:url</span> <span style="color: #fa8072;">@hmc8043</span>
<span style="color: #00ffff;">:result_type</span> <span style="color: #8470ff; font-weight: bold;">nil</span>
<span style="color: #00ffff;">:delay_after_complete</span> <span style="color: #fa8072;">200</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:OUTPut:MASTer:STATe OFF</span>
<span style="color: #ffa500;"># Set 9V &amp; 08mA on Ch1 &amp; Ch2.  Set 5V @ 60mA on Ch1.</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 1; :SOURce:VOLTage:LEVel:IMMediate:AMPLitude 9.0; :SOURce:CURRent:LEVel:IMMediate:AMPLitude 80.0e-3;</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 2; :SOURce:VOLTage:LEVel:IMMediate:AMPLitude 9.0; :SOURce:CURRent:LEVel:IMMediate:AMPLitude 80.0e-3;</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 3; :SOURce:VOLTage:LEVel:IMMediate:AMPLitude 5.0; :SOURce:CURRent:LEVel:IMMediate:AMPLitude 60.0e-3;</span>
<span style="color: #ffa500;"># Set Ch1 &amp; Ch2 to start first, and then Ch3 90ms later.</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:SEQuence:STATe OFF</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 1; :SEQuence:CHANnel:STATe ON; :SEQuence:DELay 10.0;  :SEQuence:TRIGgered OFF</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 2; :SEQuence:CHANnel:STATe ON; :SEQuence:DELay 10.0;  :SEQuence:TRIGgered OFF</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 3; :SEQuence:CHANnel:STATe ON; :SEQuence:DELay 100.0; :SEQuence:TRIGgered OFF</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:SEQuence:STATe ON</span>
<span style="color: #ffa500;"># Activate all the channels</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 1; :OUTPut:CHANnel:STATe ON</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 2; :OUTPut:CHANnel:STATe ON</span>
<span style="color: #00ffff;">:cmd</span> <span style="color: #00fa9a; font-weight: bold;">:INSTrument:NSELect 3; :OUTPut:CHANnel:STATe ON</span>
<span style="color: #ffa500;"># At this point, the master enable needs to be pressed.</span>
</pre>
</div>

<p>
<br />
</p>
<hr />
<hr />
<div class="org-center">
<p>
<code>.. END Excerpt .. END Excerpt .. END Excerpt .. END Excerpt .. END Excerpt ..</code>
</p>
</div>
<hr />
<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>
